04_OpenFoam/_ref/CFD-Notebooks_NHERI-SimCenter/exercises/E10_WindBuilding/system/profiling
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

profiling
{
    type  parProfiling;

    libs  (utilityFunctionObjects);

    // Report stats on exit only (instead of every time step)
    executeControl  onEnd;
    writeControl    none;
}


// ************************************************************************* //
